services/sos/_InsertObservation.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
        xmlns:env="http://www.w3.org/2003/05/soap-envelope"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd">
    <env:Body>
        <sos:InsertObservation
                xmlns:sos="http://www.opengis.net/sos/2.0"
                xmlns:swes="http://www.opengis.net/swes/2.0"
                xmlns:swe="http://www.opengis.net/swe/2.0"
                xmlns:sml="http://www.opengis.net/sensorML/1.0.1"
                xmlns:gml="http://www.opengis.net/gml/3.2"
                xmlns:xlink="http://www.w3.org/1999/xlink"
                xmlns:om="http://www.opengis.net/om/2.0"
                xmlns:sams="http://www.opengis.net/samplingSpatial/2.0"
                xmlns:sf="http://www.opengis.net/sampling/2.0" service="SOS" version="2.0.0" xsi:schemaLocation="http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sos.xsd            http://www.opengis.net/samplingSpatial/2.0 http://schemas.opengis.net/samplingSpatial/2.0/spatialSamplingFeature.xsd">
            <!-- optional -->
            <swes:extension>
                <swe:Boolean definition="SplitDataArrayIntoObservations">
                    <swe:value>true</swe:value>
                </swe:Boolean>
            </swes:extension>
            <sos:offering>http://www.engicloud.net/sos/ls/procedure/tps0000000001</sos:offering>
            <sos:observation>
                <om:OM_Observation gml:id="o1">
                    <om:type xlink:href="http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_SWEArrayObservation"/>
                    <om:phenomenonTime>
                        <gml:TimePeriod gml:id="phenomenonTime">
                            <gml:beginPosition>2012-11-19T13:30:00+02:00</gml:beginPosition>
                            <gml:endPosition>2012-11-19T13:44:00+02:00</gml:endPosition>
                        </gml:TimePeriod>
                    </om:phenomenonTime>

                    <om:resultTime>
                        <gml:TimeInstant gml:id="resultTime">
                            <gml:timePosition>2012-11-19T13:50:00+02:00</gml:timePosition>
                        </gml:TimeInstant>
                    </om:resultTime>

                    <om:procedure xlink:href="http://www.engicloud.net/sos/ls/procedure/tps0000000001"/>

                    <om:observedProperty xlink:href="http://sensorml.com/ont/swe/property/ObjectOfInterestIdentifier"/>



                    <om:featureOfInterest>
                        <sams:SF_SpatialSamplingFeature gml:id="point_100">
                            <gml:identifier codeSpace="">http://www.engicloud.net/sos/ls/ob/100/0</gml:identifier>
                            <gml:name>100</gml:name>
                            <sf:type xlink:href="http://www.opengis.net/def/samplingFeatureType/OGC-OM/2.0/SF_SamplingPoint"/>
                            <sf:sampledFeature xlink:href="http://www.engicloud.net/sos/ls/featureOfInterest/100/0"/>
                            <sams:shape>
                                <gml:Point gml:id="point_100_0">
                                    <gml:pos srsName="http://www.opengis.net/def/crs/EPSG/0/4326">0 0</gml:pos>
                                </gml:Point>
                            </sams:shape>
                        </sams:SF_SpatialSamplingFeature>
                    </om:featureOfInterest>




                    <om:result xsi:type="swe:DataArrayPropertyType">
                        <swe:DataArray>
                            <swe:elementCount>
                                <swe:Count>
                                    <swe:value>1</swe:value>
                                </swe:Count>
                            </swe:elementCount>
                            <swe:elementType name="Components">
                                <swe:DataRecord>
                                    <swe:field name="phenomenonTime">
                                        <swe:Time definition="http://www.opengis.net/def/property/OGC/0/PhenomenonTime">
                                            <swe:uom xlink:href="http://www.opengis.net/def/uom/ISO-8601/0/Gregorian"/>
                                        </swe:Time>
                                    </swe:field>

                                    <swe:field name="targetId">
                                        <swe:Text definition="http://sensorml.com/ont/swe/property/ObjectOfInterestIdentifier"/>
                                    </swe:field>

                                    <swe:field name="targetHeight">
                                        <swe:Quantity definition="http://sensorml.com/ont/swe/property/HeightAboveGround">
                                            <swe:uom code="m"/>
                                        </swe:Quantity>
                                    </swe:field>

                                    <swe:field name="slopeDistance">
                                        <swe:Quantity definition="http://sensorml.com/ont/swe/property/CollectorToObjectOfInterestDistance">
                                            <swe:uom code="m"/>
                                        </swe:Quantity>
                                    </swe:field>

                                    <swe:field name="horizontalDirection">
                                        <swe:Quantity definition="http://sensorml.com/ont/swe/property/Azimuth">
                                            <swe:uom code="degree"/>
                                        </swe:Quantity>
                                    </swe:field>
                                    <swe:field name="verticalAngle">
                                        <swe:Quantity definition="http://sensorml.com/ont/swe/property/AlphaAngle">
                                            <swe:uom code="degree"/>
                                        </swe:Quantity>
                                    </swe:field>

                                </swe:DataRecord>
                            </swe:elementType>
                            <swe:encoding>
                                <swe:TextEncoding tokenSeparator="#" blockSeparator="@"/>
                            </swe:encoding>
                            <swe:values>
                                2012-11-19T13:30:00+02:00#100#1.64#15.15#134.3243#100.2100@
                            </swe:values>
                        </swe:DataArray>
                    </om:result>



                </om:OM_Observation>
            </sos:observation>
        </sos:InsertObservation>
    </env:Body>
</env:Envelope>